/*

Задача 5
Напишите программу, которая запрашивает у пользователя три числа. Программа должна определить наибольшее из трёх чисел.

Например:
Ввод: -3, 10, 7 -> Результат: 10
Ввод: 9, 3, 9 -> Результат: 9

 */


package app;

import java.util.Scanner;

public class HA050625_5 {
    public static void main(String[] args) {

        Scanner scanner = new Scanner(System.in);

        System.out.print("Введите первое число: ");
        int a = scanner.nextInt();

        System.out.print("Введите второе число: ");
        int b = scanner.nextInt();

        System.out.print("Введите третье число: ");
        int c = scanner.nextInt();

        int max =

        if
        /*

        Надо сравнить три числа друг с другом, а как записать не могу сориентироваться....

         */


    }
}
