/*
Задание 1
Ваша программа должна (используя сканер) запросить

возраст пользователя
имя пользователя
Именно в таком порядке сначало возраст имени.
Естественно, все эти программы должны храниться в соответствующих переменных.

В качестве результата программа должна вывести что-то типа:

Jack (20)

Естественно, в результате должны быть подставлены введенные данные.


Задание 2
Ваша программа должна (используя сканер) запросить

имя первого пассажира
количество груза первого пассажира (целое число)
имя второго пассажира
количество груза первого пассажира (целое число)
Естественно, все эти программы должны храниться в соответствующих переменных.

В качестве результата программа должна вывести что-то типа:

Пассажир 1: имя, багаж: xxx
Пассажир 2: имя, багаж: xxx
Всего багажа: yyy

Естественно, в результате должны быть подставлены введенные данные.


Задание 3 (чуть сложнее)
Исходные данные: есть длина и ширина комнаты, площадь паркета в одной упаковке. В записной программе эта программа, которая запрашивает данные у пользователя, сохраняет эти данные в вызове, вычисляет и выводит в консоль, сколько упаковок пакета необходимо купить для этой комнаты.

Например:

Длинна комнаты: 4.0
Ширина комнаты: 3.0
В одной упаковке: 3.5 метра

Площадь комнаты 12 м.  необходимо 4 упаковки

Подсказка: здесь вам может пригодиться преобразование double - количество упаковок, получившихся при расчетах , к int

 */


package app;

public class HA_04_06_25 {
    public static void main(String[] args) {

    }
}
