
/*

Задание 1
Исходные данные программы:

имя
отчество
фамилия
Создайте переменные для этих данных. После этого сформируйте строку вида:

Николай Иванович Петров (Н.И. Петров)
Копировать
Подсказка: что бы получить вещи, воспользуйтесь charAt как мы делали на занятии


Задание 2
Обратная задача. Исходные данные программы: строка вида

Николай Иванович Петров
Копировать
Написать программу, которая подбирает текст из трех переменных:

имя
отчество
фамилия
Подсказка: Вам следует использовать методы строк indexOf(), LastIndexOf и substring().

 */

package app;

public class HA030625 {
    public static void main(String[] args) {

    }
}
